---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.IndexPrimitive
source: html/b0d7ba2c-d417-8f0b-070e-8eed7afe5a6d.htm
---
# IndexPrimitive Properties

Specifies whether the .NET object represents a valid Revit entity.